; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(have_image Phenomenon8 image2)
	(have_image Star9 image2)
	(have_image Planet10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Star12 thermograph1)
	(have_image Planet13 thermograph1)
	(have_image Star14 image2)
	(have_image Phenomenon15 image2)
	(have_image Planet16 thermograph1)
	(have_image Planet17 image2)
))

)

; plan
1. (turn_to satellite0 groundstation4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 planet13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet13)
   goals met: 0 of 10
5. (take_image satellite0 planet13 instrument0 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 1 of 10
6. (turn_to satellite0 planet10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet10)
   goals met: 1 of 10
7. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon8 instrument0 image2)
   added: (have_image phenomenon8 image2)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon15 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon15)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon15 instrument0 image2)
   added: (have_image phenomenon15 image2)
   goals met: 4 of 10
12. (turn_to satellite0 planet16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet16)
   goals met: 4 of 10
13. (take_image satellite0 planet16 instrument0 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 5 of 10
14. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 5 of 10
15. (take_image satellite0 planet17 instrument0 image2)
   added: (have_image planet17 image2)
   goals met: 6 of 10
16. (turn_to satellite0 star11 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
17. (take_image satellite0 star11 instrument0 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 7 of 10
18. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 7 of 10
19. (take_image satellite0 star12 instrument0 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 8 of 10
20. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 8 of 10
21. (take_image satellite0 star14 instrument0 image2)
   added: (have_image star14 image2)
   goals met: 9 of 10
22. (turn_to satellite0 star9 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star9)
   goals met: 9 of 10
23. (take_image satellite0 star9 instrument0 image2)
   added: (have_image star9 image2)
   goals met: 10 of 10
